Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetDirEnum
The lap offset direction.

Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetDirEnum.OnLegFace
On leg face.

Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetDirEnum.PerpendicularToLegFace
Perpendicular to leg face.